# Numpy

In [1]:
a = [1,2,3]
b = [2,3,4]

In [4]:
for z, i in zip(a,b):
    print(z*i)
[z*i for z,i in zip(a,b)]

2
6
12

[2, 6, 12]

In [5]:
import numpy as np
a = np.array([1,2,3])
b = np.array([2,3,4])

In [6]:
type(a)

numpy.ndarray

In [7]:
a*b

array([ 2,  6, 12])

In [8]:
import numpy as np
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U6')

In [13]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [14]:
df.columns = ['name','gender','age']

In [15]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

# Series

In [17]:
import pandas as pd
phone = pd.Series([21000,19000,18000])
phone

0    21000
1    19000
2    18000
dtype: int64

In [19]:
phone = pd.Series([21000,19000,18000],index = ['Iphone 7','MI','VIVO'])
phone

Iphone 7    21000
MI          19000
VIVO        18000
dtype: int64

In [20]:
phone[1]

19000

In [21]:
phone['VIVO']

18000

# DataFrame

In [23]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df.columns = ['name','gender','age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [25]:
df.head(2)

    name gender  age
0  frank      M   29
1   mary      F   23

In [26]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name      6 non-null object
gender    6 non-null object
age       6 non-null int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [28]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

# 数据的筛选

In [30]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [38]:
df.loc[1]

name      mary
gender       F
age         23
Name: 1, dtype: object

In [36]:
df.loc[1:4]

   name gender  age
1  mary      F   23
2   tom      M   35
3   ted      M   33
4  jean      F   21

In [40]:
df[['name','age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [41]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [42]:
df.loc[1:2,['name','age']]

   name  age
1  mary   23
2   tom   35

In [44]:
?df.iloc

In [45]:
df['gender']

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [46]:
df.gender

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [48]:
#根据一些条件去查询数据
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [49]:
df[df['gender']== 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [50]:
df['age'] > 30

0    False
1    False
2     True
3     True
4    False
5    False
Name: age, dtype: bool

In [51]:
df[df['age'] > 30]

  name gender  age
2  tom      M   35
3  ted      M   33

In [55]:
#根据一些交集查询数据（男性而且年纪大于30）
df[(df['gender']=='M')& (df['age'] > 30)]

  name gender  age
2  tom      M   35
3  ted      M   33

In [56]:
#根据连集查询数据（男性或者年纪大于30）
df[(df['gender']=='M')| (df['age'] > 30)]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [62]:
#增添以及删除的常规操作
df['employee'] = True

In [63]:
df.head()

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True

In [64]:
del df['employee']
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [66]:
df['employee'] = True
df.head()

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True

In [69]:
df = df.drop('employee',axis = 1)
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [71]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [72]:
df.loc[5]

name      lisa
gender       F
age         20
Name: 5, dtype: object

In [77]:
df.loc[6] = {'age':20,'gender':'F','name':'qoo'}

In [78]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20
6    qoo      F   20

In [79]:
df = df.drop(6)
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [81]:
df = df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),ignore_index=True)

In [82]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo

In [83]:
df = df.drop(6)

In [84]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [85]:
#设定新索引

In [87]:
df['userid'] = range(101,107)
df

   age gender   name  userid
0   29      M  frank     101
1   23      F   mary     102
2   35      M    tom     103
3   33      M    ted     104
4   21      F   jean     105
5   20      F   lisa     106

In [88]:
df.set_index('userid',inplace=True)
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa

In [89]:
#根据位置提取数据
#ix 已经弃用了。
df.iloc[1]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [93]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [94]:
#根据索引取值
df.loc[[103,105]]

        age gender  name
userid
103      35      M   tom
105      21      F  jean

In [96]:
df.ix[[103,105]]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

        age gender  name
userid
103      35      M   tom
105      21      F  jean